#Ввести произвольное число в консоле
#Ввести пограничное число в консоле
#Если 1ое число меньше пограничного, вывести сообщение об этом.
#Если 1ое число больше пограничного, вывести сообщение об этом.
#Если 1ое число больше пограничного более, чем в 3 раза, сообщить об этом.
number = int(input("введите число:"))
border_number = 42
if number1 < Border_number:
    print("1ое число меньше пограничного")
if number1 > border_number:
    print("1ое число больше пограничного")
if number1 > border_number*3:
    print("1ое число больше пограничного более, чем в 3 раза")
